# SetOnLocalLinkSharedCoordinatesSavedCallback Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkOperations..::..SetOnLocalLinkSharedCoordinatesSavedCallback Method
LinkOperations Class See Also
---
Sets the callback that will be called when the Revit user saves new shared coordinate settings to a linked document obtained from an IExternalResourceServer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void SetOnLocalLinkSharedCoordinatesSavedCallback(
	IOnLocalLinkSharedCoordinatesSavedCallback onLocalLinkSharedCoordinatesSaved
)
```

Visual Basic
---
```text
Public Sub SetOnLocalLinkSharedCoordinatesSavedCallback ( _
	onLocalLinkSharedCoordinatesSaved As IOnLocalLinkSharedCoordinatesSavedCallback _
)
```

Visual C++
---
```text
public:
void SetOnLocalLinkSharedCoordinatesSavedCallback(
	IOnLocalLinkSharedCoordinatesSavedCallback^ onLocalLinkSharedCoordinatesSaved
)
```

# ### Parameters
onLocalLinkSharedCoordinatesSaved
    Type: Autodesk.Revit.DB..::..IOnLocalLinkSharedCoordinatesSavedCallback An IOnLocalLinkSharedCoordinatesSavedCallback object that can respond when the user saves new shared coordinates to a Revit link document obtained from IExternalResourceServer.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LinkOperations Class
Autodesk.Revit.DB Namespace